common-build-files/universe/real/uv-webb-common-datasource.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://org.apache.axis2/xsd"
    xmlns:nds="http://services.core.ndatasource.carbon.wso2.org/xsd"
    xmlns:ndsc="http://core.ndatasource.carbon.wso2.org/xsd">

    <soapenv:Header/>
    <soapenv:Body>
        <xsd:addDataSource>
            <xsd:dsmInfo>
                <nds:definition>
                    <nds:dsXMLConfiguration>
                        <![CDATA[
                            <configuration>
                                <customDataSourceClass>com.mitra.middleware.dss.connector.universe.UniverseConnector</customDataSourceClass>
                                <customDataSourceProps>
                                    <property name="universe.username">@uvCommonUsername@</property>
                                    <property name="universe.password">@uvCommonPassword@</property>
                                    <property name="universe.hostname">@uvWebBHost@</property>
                                    <property name="universe.accountpath">@uvCommonAccount@</property>
                                    <property name="universe.pool.threshold.idle">10000</property>
                                    <property name="universe.pool.threshold.exec">10000</property>
                                    <property name="universe.pool.connections.min">@uvCommonWebBMinConnections@</property>
                                    <property name="universe.pool.connections.max">@uvCommonWebBMaxConnections@</property>
                                </customDataSourceProps>
                            </configuration>
                        ]]>
                    </nds:dsXMLConfiguration>
                    <nds:type>DS_CUSTOM_QUERY</nds:type>
                </nds:definition>
                <nds:description>universe-webb-common</nds:description>
                <nds:name>universe-webb-common</nds:name>
                <nds:system>false</nds:system>
                <nds:jndiConfig>
                    <ndsc:name>jdbc/universe-webb-common</ndsc:name>
                </nds:jndiConfig>
            </xsd:dsmInfo>
        </xsd:addDataSource>
    </soapenv:Body>

</soapenv:Envelope>
